Catalogs/ДоговорыПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ДоговорыПоставщиков</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешнийВидДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаключенияДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОкончанияДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакБессрочногоДоговора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ДоговорыПоставщиков/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытий
&НаКлиенте
Процедура ПризнакБессрочногоДоговораПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		СформироватьНаименованиеДоговора();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВнешнийВидДоговораПриИзменении(Элемент)
	СформироватьНаименованиеДоговора();
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗаключенияДоговораПриИзменении(Элемент)
	СформироватьНаименованиеДоговора();
КонецПроцедуры
#КонецОбласти
                          
#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура УстановитьВидимость()
Если Объект.ПризнакБессрочногоДоговора Тогда
    Элементы.СрокОкончанияДоговора.Видимость = Ложь;
	Если ЗначениеЗаполнено(Объект.СрокОкончанияДоговора) Тогда
		Объект.СрокОкончанияДоговора = '0001,01,01';
	КонецЕсли;
Иначе
    Элементы.СрокОкончанияДоговора.Видимость = Истина;
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименованиеДоговора()
	Если ЗначениеЗаполнено(Объект.ВнешнийВидДоговора)
		И ЗначениеЗаполнено(Объект.ДатаЗаключенияДоговора) Тогда
		Объект.Наименование = "№ " + Объект.ВнешнийВидДоговора + " от " + Формат(Объект.ДатаЗаключенияДоговора,"ДФ='dd.MM.yyyy ""г.""'"); 	
	ИначеЕсли ЗначениеЗаполнено(Объект.ВнешнийВидДоговора) Тогда  
		Объект.Наименование = "№ " + Объект.ВнешнийВидДоговора;
	Иначе
		Объект.Наименование = " от " + Формат(Объект.ДатаЗаключенияДоговора,"ДФ='dd.MM.yyyy ""г.""'");
	КонецЕсли;
КонецПроцедуры   
#КонецОбласти
